// @strict-types

#Область ПрограммныйИнтерфейс

// Регистрация тестов YAxUnit.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ДобавитьТестовыйНабор("Базовые")
			.ДобавитьСерверныйТест("ДваПлюсДваРавноЧетыре")
			.ДобавитьСерверныйТест("ПустаяСтрокаНеЗаполнена")
			.ДобавитьСерверныйТест("НовыйМассивПуст");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДваПлюсДваРавноЧетыре() Экспорт

	// Act
	Результат = 2 + 2;

	// Assert
	ЮТест.ОжидаетЧто(Результат).Равно(4);

КонецПроцедуры

Процедура ПустаяСтрокаНеЗаполнена() Экспорт

	// Assert
	ЮТест.ОжидаетЧто("").НеЗаполнено();
	ЮТест.ОжидаетЧто("hello").Заполнено();

КонецПроцедуры

Процедура НовыйМассивПуст() Экспорт

	// Arrange
	Массив = Новый Массив;

	// Assert
	ЮТест.ОжидаетЧто(Массив.Количество()).Равно(0);

КонецПроцедуры

#КонецОбласти
